#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```terraform
module.Edumet.heroku_app.edumet: Refreshing state... [id=edumet]
module.uCallSystemProd.heroku_app.ucall_system_prod: Refreshing state... [id=ucall-system-prod]
module.uCallApp.cloudflare_record.ucall_app: Refreshing state... [id=b8a15366be6ba54a55205b70e9b8f0f1]
module.PersonalBlog.heroku_app.megatunger_blog: Refreshing state... [id=megatunger-blog]
module.LuaLepAPI.cloudflare_record.lualep: Refreshing state... [id=f343d9cd66533f6aae7ecedb422555d6]
module.uCallLandingPage.heroku_app.ucall_landing_page: Refreshing state... [id=ucall-landing-page]
module.BinhMinhIdCardAPI.heroku_app.bmidcard_api: Refreshing state... [id=binhminh-idcard-api]
module.LuaLepAPI.heroku_app.lualep: Refreshing state... [id=lua-lep-api]
module.TestReady.cloudflare_record.www_testready: Refreshing state... [id=f6c9a4e7941a8e864238a3cceadd1cef]
module.TestReady.cloudflare_record.testready: Refreshing state... [id=633b4e558148faceea66d6e1d5880876]
module.SolveX.heroku_app.solvex: Refreshing state... [id=solve-x]
module.uCallApp.heroku_app.ucall_app: Refreshing state... [id=ucall-app]
module.PersonalBlog.cloudflare_record.megatunger: Refreshing state... [id=284f02403cab8e2f8169585c87c2106d]
module.PersonalBlog.cloudflare_record.www_megatunger: Refreshing state... [id=b98af5802fc48600cad3132f0f56f7cd]
module.AIAcademyLandingPage.heroku_app.ai_academy: Refreshing state... [id=ai-academy-landing-page]
module.SolveX.cloudflare_record.sendgrid_1: Refreshing state... [id=65c42903cf538d9a69e031304319be39]
module.SolveX.cloudflare_record.solvex: Refreshing state... [id=29929e3829a14f6b3f91cdb3d8de1166]
module.SolveX.cloudflare_record.sendgrid_2: Refreshing state... [id=39e8d43dcd2eeb7830d332b07a15e4b0]
module.SolveX.cloudflare_record.sendgrid_3: Refreshing state... [id=9f48d90cc864b70a197082384d3989af]
module.SolveX.cloudflare_record.www_solvex: Refreshing state... [id=b194e7e350c45de8ebc061f9116074ac]
module.uCallSystemProd.cloudflare_record.ucall_system_prod: Refreshing state... [id=c4bc8599047630b9d22d1fb02cec2585]
module.BinhMinhIdCardAPI.cloudflare_record.bmidcard_api: Refreshing state... [id=04a2377486d7298328d160ac19deece1]
module.AIAcademyLandingPage.cloudflare_record.ai_academy: Refreshing state... [id=0a5cf682c9e6ab6f0617fed01ed0f216]
module.BinhMinhERP.cloudflare_record.binhminh_erp_sendgrid_3: Refreshing state... [id=c637dde6b0a6ca0b95a9290488db1e4f]
module.BinhMinhERP.cloudflare_record.binhminh_erp_sendgrid_4: Refreshing state... [id=b4f9e88334045a0e35152b58812bb713]
module.BinhMinhERP.cloudflare_record.binhminh_erp_sendgrid_1: Refreshing state... [id=3582aff137e0b139f4a62723944643ef]
module.BinhMinhERP.cloudflare_record.binhminh_erp_sendgrid_5: Refreshing state... [id=b6758c86fbd62dec46e0ad573d11fbc4]
module.BinhMinhERP.cloudflare_record.binhminh_erp_sendgrid_2: Refreshing state... [id=a5375d4fa013a7250d1f22dd5cb23e47]
module.uCallLandingPage.cloudflare_record.www_ucall_landing_page: Refreshing state... [id=0b8ad0731f463a96d2145f2206762939]
module.uCallLandingPage.cloudflare_record.ucall_landing_page: Refreshing state... [id=614f100b56a33840c6fbec08a2eb9059]
module.uCallLandingPage.cloudflare_record.www_ucall_landing_page_etron_research: Refreshing state... [id=185bbef6cacacbf56ffa9ac2bba828f3]
module.uCallLandingPage.cloudflare_record.ucall_landing_page_etron_research: Refreshing state... [id=a5af189401ffcb6ac3226bef3521d522]
module.Edumet.cloudflare_record.edumet: Refreshing state... [id=895b92f574ab20d5099bc67e03734640]
module.Edumet.cloudflare_record.edumet_www: Refreshing state... [id=7f07a6aa62135757383a602c517435fe]
module.TestReady.heroku_app.testready: Refreshing state... [id=testready-megatunger]
module.Edumet.heroku_domain.edumet: Refreshing state... [id=212abe17-1a8c-40d7-99c4-8207c7d59561]
module.Edumet.heroku_build.edumet: Refreshing state... [id=eaa9eb6d-ae15-44e5-a1b4-504dbd1f93b6]
module.uCallSystemProd.heroku_addon.redis: Refreshing state... [id=ce2620d1-a1c1-4c56-9ca9-4c5f102b17b5]
module.uCallSystemProd.heroku_domain.ucall_system_prod: Refreshing state... [id=c306ecf2-e4ad-4812-b3af-60788a585185]
module.uCallSystemProd.heroku_build.ucall_system_prod: Refreshing state... [id=ab87b748-355e-4eab-bf2b-51dcbbe9ab91]
module.LuaLepAPI.heroku_build.lualep: Refreshing state... [id=5a105063-1f3a-44d4-a867-91ae963e8f28]
module.LuaLepAPI.heroku_domain.lualep: Refreshing state... [id=bd314fe1-bcf8-47f6-afbc-0662cad6d414]
module.PersonalBlog.heroku_domain.www_megatunger_blog: Refreshing state... [id=c24ce942-25fc-496c-9ce7-ac0e85a9cf44]
module.PersonalBlog.heroku_domain.megatunger_blog: Refreshing state... [id=a69d9820-bf34-41d1-93d7-43b90cb17098]
module.PersonalBlog.heroku_build.megatunger_blog: Refreshing state... [id=e908dbbc-5c5d-48cf-853f-2be1b3547987]
module.uCallLandingPage.heroku_domain.www_ucall_landing_page: Refreshing state... [id=e7258a14-9374-4080-928e-b3f978827e6e]
module.uCallLandingPage.heroku_domain.www_ucall_landing_page_etron_research: Refreshing state... [id=68338e64-6834-4d0e-94fb-4c74e3c7fe78]
module.uCallLandingPage.heroku_domain.ucall_landing_page: Refreshing state... [id=1d6bc274-1b84-4253-ad27-02fc51ba62be]
module.uCallLandingPage.heroku_build.ucall_landing_page: Refreshing state... [id=0083ff89-f520-4479-b8a8-8975af85c5d7]
module.uCallLandingPage.heroku_addon.database: Refreshing state... [id=0ab65ddc-216b-496e-b95a-878e6e7ef0a3]
module.uCallLandingPage.heroku_domain.ucall_landing_page_etron_research: Refreshing state... [id=cb776a6f-31dd-4f02-af8a-a320a43a7059]
module.BinhMinhIdCardAPI.heroku_build.bmidcard_api: Refreshing state... [id=e0ffc8aa-2898-44da-9ace-0c082e1c7c0a]
module.BinhMinhIdCardAPI.heroku_domain.bmidcard_api: Refreshing state... [id=eafe1550-e4ee-4f2b-b85d-0f36b9b0bc08]
module.SolveX.heroku_addon.database: Refreshing state... [id=dbc2d3d3-111c-4e66-bb1a-ac2c02ee8c22]
module.SolveX.heroku_build.solvex: Refreshing state... [id=1fef393f-ee59-4a48-973d-acec350aa09f]
module.SolveX.heroku_domain.solvex: Refreshing state... [id=842e608b-6b96-4f49-b4ce-0c1240453fed]
module.SolveX.heroku_addon.redis: Refreshing state... [id=0636bb15-2ab9-47f3-b142-686df21a1963]
module.SolveX.heroku_domain.www_solvex: Refreshing state... [id=8a2cd6b7-c848-4abf-8f72-a14db3945aa3]
module.uCallApp.heroku_build.ucall_app: Refreshing state... [id=c14a54f0-3955-42fe-a61a-5ca0f7ef732d]
module.uCallApp.heroku_domain.ucall_app: Refreshing state... [id=28483b1c-c55b-4c7f-98d0-6396681f7694]
module.AIAcademyLandingPage.heroku_build.ai_academy: Refreshing state... [id=f3fd68ea-b408-4591-a4da-c2914d27ab5c]
module.AIAcademyLandingPage.heroku_domain.ai_academy: Refreshing state... [id=bd9b6796-5555-4972-9f12-0d8faff05831]
module.TestReady.heroku_build.testready: Refreshing state... [id=7f8dabbc-8eba-4464-b65d-f31f0fa43c9c]
module.TestReady.heroku_addon.redis: Refreshing state... [id=36d41931-c9a0-4941-89b3-2a1e085d695a]
module.TestReady.heroku_domain.testready: Refreshing state... [id=4853ba53-4640-44cd-8bca-78b3e07c10e1]
module.TestReady.heroku_addon.database: Refreshing state... [id=3a3dfb0f-7372-439c-9263-4906fbd57f43]
module.TestReady.heroku_domain.www_testready: Refreshing state... [id=fab695c8-ee64-4530-abef-ba4ea9141f6e]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.uCallApp.cloudflare_record.ucall_app must be replaced
-/+ resource "cloudflare_record" "ucall_app" {
      ~ created_on  = "2021-03-31T11:09:37.732711Z" -> (known after apply)
      - data        = {} -> null
      ~ hostname    = "app.ucall.cc" -> (known after apply)
      ~ id          = "b8a15366be6ba54a55205b70e9b8f0f1" -> (known after apply)
      ~ metadata    = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
          - "source"                 = "primary"
        } -> (known after apply)
      ~ modified_on = "2021-03-31T11:09:37.732711Z" -> (known after apply)
        name        = "app"
      - priority    = 0 -> null
      ~ proxiable   = true -> (known after apply)
      ~ ttl         = 1 -> (known after apply)
      ~ zone_id     = "754ed0ce36eb0894c65b8214f2757dc2" -> "6df96a8f3262d01a327bc529f7678bcb" # forces replacement
        # (3 unchanged attributes hidden)
    }

  # module.uCallApp.heroku_domain.ucall_app must be replaced
-/+ resource "heroku_domain" "ucall_app" {
      ~ cname    = "parallel-jackfruit-kfkh8u6z9xqix6bus8b163cd.herokudns.com" -> (known after apply)
      ~ hostname = "app.ucall.cc" -> "app.ucall.asia" # forces replacement
      ~ id       = "28483b1c-c55b-4c7f-98d0-6396681f7694" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.uCallLandingPage.cloudflare_record.ucall_landing_page must be replaced
-/+ resource "cloudflare_record" "ucall_landing_page" {
      ~ created_on  = "2021-03-31T10:18:26.311789Z" -> (known after apply)
      - data        = {} -> null
      ~ hostname    = "ucall.cc" -> (known after apply)
      ~ id          = "614f100b56a33840c6fbec08a2eb9059" -> (known after apply)
      ~ metadata    = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
          - "source"                 = "primary"
        } -> (known after apply)
      ~ modified_on = "2021-03-31T10:18:26.311789Z" -> (known after apply)
        name        = "@"
      - priority    = 0 -> null
      ~ proxiable   = true -> (known after apply)
      ~ ttl         = 1 -> (known after apply)
      ~ zone_id     = "754ed0ce36eb0894c65b8214f2757dc2" -> "6df96a8f3262d01a327bc529f7678bcb" # forces replacement
        # (3 unchanged attributes hidden)
    }

  # module.uCallLandingPage.cloudflare_record.www_ucall_landing_page must be replaced
-/+ resource "cloudflare_record" "www_ucall_landing_page" {
      ~ created_on  = "2021-03-31T10:18:26.419353Z" -> (known after apply)
      - data        = {} -> null
      ~ hostname    = "www.ucall.cc" -> (known after apply)
      ~ id          = "0b8ad0731f463a96d2145f2206762939" -> (known after apply)
      ~ metadata    = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
          - "source"                 = "primary"
        } -> (known after apply)
      ~ modified_on = "2021-03-31T10:18:26.419353Z" -> (known after apply)
        name        = "www"
      - priority    = 0 -> null
      ~ proxiable   = true -> (known after apply)
      ~ ttl         = 1 -> (known after apply)
      ~ zone_id     = "754ed0ce36eb0894c65b8214f2757dc2" -> "6df96a8f3262d01a327bc529f7678bcb" # forces replacement
        # (3 unchanged attributes hidden)
    }

  # module.uCallLandingPage.heroku_domain.ucall_landing_page must be replaced
-/+ resource "heroku_domain" "ucall_landing_page" {
      ~ cname    = "octagonal-honeydew-r7ucc0motu16kz35pkuwlc7w.herokudns.com" -> (known after apply)
      ~ hostname = "ucall.cc" -> "ucall.asia" # forces replacement
      ~ id       = "1d6bc274-1b84-4253-ad27-02fc51ba62be" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.uCallLandingPage.heroku_domain.www_ucall_landing_page must be replaced
-/+ resource "heroku_domain" "www_ucall_landing_page" {
      ~ cname    = "aquatic-anteater-gbwzcekqud752jy0g6uihw1s.herokudns.com" -> (known after apply)
      ~ hostname = "www.ucall.cc" -> "www.ucall.asia" # forces replacement
      ~ id       = "e7258a14-9374-4080-928e-b3f978827e6e" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.uCallSystemProd.cloudflare_record.ucall_system_prod must be replaced
-/+ resource "cloudflare_record" "ucall_system_prod" {
      ~ created_on  = "2021-03-31T08:58:41.614127Z" -> (known after apply)
      - data        = {} -> null
      ~ hostname    = "api.ucall.cc" -> (known after apply)
      ~ id          = "c4bc8599047630b9d22d1fb02cec2585" -> (known after apply)
      ~ metadata    = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
          - "source"                 = "primary"
        } -> (known after apply)
      ~ modified_on = "2021-03-31T08:58:41.614127Z" -> (known after apply)
        name        = "api"
      - priority    = 0 -> null
      ~ proxiable   = true -> (known after apply)
      ~ ttl         = 1 -> (known after apply)
      ~ zone_id     = "754ed0ce36eb0894c65b8214f2757dc2" -> "6df96a8f3262d01a327bc529f7678bcb" # forces replacement
        # (3 unchanged attributes hidden)
    }

  # module.uCallSystemProd.heroku_domain.ucall_system_prod must be replaced
-/+ resource "heroku_domain" "ucall_system_prod" {
      ~ cname    = "still-sparrow-i9bmj4k8lnbidfbghgajg1k8.herokudns.com" -> (known after apply)
      ~ hostname = "api.ucall.cc" -> "api.ucall.asia" # forces replacement
      ~ id       = "c306ecf2-e4ad-4812-b3af-60788a585185" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 8 to add, 0 to change, 8 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```
</details>
*Pusher: @megatunger, Action: `pull_request`*